In [1]:
# I'm a code cell, click me, then run me!
256 * 60 * 24 # Children × minutes × hours

368640

In [2]:
def greet(first_name, last_name):
    greeting = 'My name is ' + last_name + ', ' + first_name + ' ' + last_name + '!'
    return greeting

# Replace with your first and last name.
# That is, unless your name is already Jane Bond.
greet('Mohd', 'Atif')

'My name is Atif, Mohd Atif!'

In [15]:
import cx_Oracle
import pandas as pd
username = 'arup'
password = 'arup'
dbname =   '192.168.29.71:1521/testpdb1.localdomain'
con = cx_Oracle.connect(username,password,dbname)
print(con.version)
cursor = con.cursor()
#cursor.execute('CREATE TABLE A1(c1 number, c2 number)')
statement1 = ('SELECT ID, NAME FROM TEST_EMP')
cursor.execute(statement1,)
rows = cursor.fetchall()
for row in rows:
    print(row)

con.commit()

query = """SELECT ID, NAME FROM TEST_EMP"""

df = pd.read_sql(query, con)
print(df)

19.3.0.0.0
(1, 'ATIF')
(2, 'AMIT')
(None, 'ARUN')
(None, 'ARUN')
    ID  NAME
0  1.0  ATIF
1  2.0  AMIT
2  NaN  ARUN
3  NaN  ARUN